.emacs.d/init.el
;; Generating This Document

;; Here's a convenience function that generates the files mentioned in
;; the previous section:


(defun export-init-org ()
  "Generate init.el and init.htm from the current init.org file."
  (interactive)
  (call-interactively #'org-babel-tangle)
  (call-interactively #'org-html-export-as-html))

;; General Folder Structure

;;  The load path is the list of directories that Emacs searches for
;;  executing Elisp code (i.e. by using "require").

;;  I store the Emacs Lisp code that I write inside the user-lisp folder.


(add-to-list 'load-path "~/.emacs.d/user-lisp")

;; Package Management

;; Load package.el:


(require 'package)
(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("melpa" . "https://melpa.org/packages/")
        ("org" . "http://orgmode.org/elpa")))
(package-initialize)



;; Bootstrap use-package:


(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))



;; Add an environment variable required by the PDF Tools package:


(setenv "PKG_CONFIG_PATH" "/usr/local/Cellar/zlib/1.2.8/lib/pkgconfig:/usr/local/lib/pkgconfig:/opt/X11/lib/pkgconfig")

;; General Customizations

;; Make sure we can debug init errors more easily:


(if init-file-debug
    (setq use-package-verbose t
          use-package-expand-minimally nil
          use-package-compute-statistics t
          debug-on-error t)
  (setq use-package-verbose nil
        use-package-expand-minimally t))



;; Start Emacs fully maximized:


(add-to-list 'default-frame-alist '(fullscreen . maximized))



;; Some general functions that I've written.


(require 'defuns-config)



;; And some general keybinding modifications.


(require 'keybindings)

;; Custom Keymaps

;; Define my custom prefix keys:


(eval-and-compile
  (mapc #'(lambda (entry)
            (define-prefix-command (cdr entry))
            (bind-key (car entry) (cdr entry)))
        '(("C-c w" . my-ctrl-c-w-map))))

;; Mac

;; On a Mac, I use the Command key as Meta.


(setq mac-option-modifier 'none)
(setq mac-command-modifier 'meta)
(setq ns-function-modifier 'hyper)



;; GUI apps on macOS do not inherit $PATH from shell. This package solves
;; that.


(use-package exec-path-from-shell
  :ensure t
  :if (memq window-system '(mac ns))
  :config
  (progn
    (setq exec-path-from-shell-arguments '("-l"))
    (setq exec-path-from-shell-variables
          (append exec-path-from-shell-variables '("JAVA_HOME")))
    (exec-path-from-shell-initialize)))

;; Appearance and Themes

;; Appearances and themes are loaded from their own file.


(require 'appearance)

;; Ediff

;; I like Ediff's control panel to show in a separate frame, even on
;; graphical environments.


(setq ediff-window-setup-function 'ediff-setup-windows-plain)

;; File Backup Management

;; Store Emacs backup files in their own directory, so as not to pollute
;; the current directory.


(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-list-file-name-transforms '((".*", "~/.emacs.d/auto-save-list" t)))

;; Ido and Recentf

;; I use Ido ("Interactive Do") as a simple way to switch between open
;; buffers.


(ido-mode t)



;; Recentf is a mode for displaying recently open files.


(recentf-mode 1)

;; Line Numbers

;; I use display-line-numbers, but only for programming modes.


(add-hook 'prog-mode-hook 'display-line-numbers-mode)



;; I also highlight the current line, only for programming modes.


(add-hook 'prog-mode-hook 'hl-line-mode)

;; Mode Line

;; Show in which function or method the point is.

;; Disabled for now until this problem with swift-mode is fixed:
;; https://github.com/swift-emacs/swift-mode/issues/157


(which-function-mode 0)



;; Show column numbers in the mode line.


(column-number-mode 1)



;; Show the current time.


(use-package time
  :ensure t
  :config
  (progn
    (setf display-time-default-load-average nil
          display-time-use-mail-icon t
          display-time-24hr-format nil)
    (display-time-mode t)))

;; Navigation Tree

;; Treemacs is a tree layout file explorer for Emacs:


(use-package treemacs
  :ensure t
  :commands treemacs
  :config
  (progn
    (setq treemacs-collapse-dirs              (if (executable-find "python") 3 0)
          treemacs-file-event-delay           5000
          treemacs-follow-after-init          t
          treemacs-follow-recenter-distance   0.1
          treemacs-goto-tag-strategy          'refetch-index
          treemacs-indentation                2
          treemacs-indentation-string         " "
          treemacs-is-never-other-window      nil
          treemacs-no-png-images              nil
          treemacs-project-follow-cleanup     nil
          treemacs-recenter-after-file-follow nil
          treemacs-recenter-after-tag-follow  nil
          treemacs-show-hidden-files          t
          treemacs-silent-filewatch           nil
          treemacs-silent-refresh             nil
          treemacs-sorting                    'alphabetic-desc
          treemacs-tag-follow-cleanup         t
          treemacs-tag-follow-delay           1.5
          treemacs-width                      35)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (pcase (cons (not (null (executable-find "git")))
                 (not (null (executable-find "python3"))))
      (`(t . t)
       (treemacs-git-mode 'extended))
      (`(t . _)
       (treemacs-git-mode 'simple))))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))



;; Integrate Treemacs with Projectile:


(use-package treemacs-projectile
  :ensure t
  :after treemacs projectile)

;; Pairs

;; To ease working with pairs, I use the smartparens package.


(use-package smartparens-config
  :commands smartparens-mode)



;; Highlight parentheses pairs.


(show-paren-mode 1)



;; Close pairs automatically.


(electric-pair-mode 1)



;; Rainbow-delimiters is a package which highlights delimiters such as
;; parentheses, brackets or braces according to their depth


(use-package rainbow-delimiters
  :ensure t
  :hook ((emacs-lisp-mode . rainbow-delimiters-mode)
         (ielm-mode . rainbow-delimiters-mode))
  :config
  (set-face-foreground 'rainbow-delimiters-depth-1-face "snow4")
  (setf rainbow-delimiters-max-face-count 1)
  (set-face-attribute 'rainbow-delimiters-unmatched-face nil
                      :foreground 'unspecified
                      :inherit 'error)
  (set-face-foreground 'rainbow-delimiters-depth-1-face "snow4"))
