.emacs.d/init.org
*** Trailing Whitespace

Remove trailing whitespace before saving a file.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

*** Window Management

I use winner-mode to manage my windows with convenient undo/redo functions.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (winner-mode 1)
#+END_SRC

*** Cross References

Use ivy-xref to select cross references:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ivy-xref
    :ensure t
    :after ivy
    :init (setq xref-show-xrefs-function #'ivy-xref-show-xrefs))
#+END_SRC

** Programming Language Customizations

These are my customizations for the programming languages I use most.

I generally dislike tabs in my programs.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq-default indent-tabs-mode nil)
#+END_SRC

*** C/C++/Objective-C/Objective-C++

For C languages, I use K&R style, with an indentation of 2 spaces.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package cc-mode
    :config
    (add-hook 'c-mode-common-hook (lambda ()
                             (c-set-style "k&r")
                             (setq c-basic-offset 2)))
    ;; Enable LSP support.
    :hook ((c-mode c++-mode objc-mode) .
           (lambda () (require 'ccls) (lsp)))
    ;; Format with clang-format.
    :bind (:map c-mode-base-map
                ("C-c u" . clang-format)))
#+END_SRC

As there's not a specific Emacs mode for this programming language,
for Objective-C++ files, use Objective-C mode.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-to-list 'auto-mode-alist '("\\.mm$" . objc-mode))
#+END_SRC

Use LSP with company, and ccls as C++ client.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package lsp-mode
    :ensure t
    :load-path "~/Projects/lsp-mode"
    :bind (:map lsp-mode-map
                ("C-c C-d" . lsp-describe-thing-at-point))
    :commands lsp
    :config
    (setq lsp-prefer-flymake nil)
    (setq xref-prompt-for-identifier '(not xref-find-definitions
                                           xref-find-definitions-other-window
                                           xref-find-definitions-other-frame
                                           xref-find-references)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package lsp-sourcekit
    :ensure t
    :after lsp-mode
    :load-path "~/Projects/lsp-sourcekit"
    :config
    (setenv "SOURCEKIT_TOOLCHAIN_PATH" "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain")
    (setq lsp-sourcekit-executable (expand-file-name "~/Projects/swift-source/sourcekit-lsp/.build/debug/sourcekit-lsp")))
#+END_SRC

LSP UI contains higher level UI modules for lsp-mode, like flycheck
support or code lenses.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
    (use-package lsp-ui
      :ensure t
      :after lsp-mode
      :commands lsp-ui-mode
      :config
      (setq lsp-ui-sideline-enable nil))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package company-lsp
    :ensure t
    :after lsp-mode
    :commands company-lsp)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ccls
    :ensure t
    :diminish ccls-code-lens-mode
    :after lsp-mode
    :config
    (add-hook 'lsp-after-open-hook #'ccls-code-lens-mode)
    (setq ccls-executable (expand-file-name "~/Projects/ccls/Release/ccls")))
#+END_SRC

*** Clojure

Cider is the "de facto" package for working on Clojure projects.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package cider
    :ensure t
    :defer t)
#+END_SRC

*** Djinni

Djinni is a IDL by Dropbox that helps generating interface code in C++/Objective-C++/Java.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package djinni-mode
    :ensure t
    :load-path "~/Projects/djinni-mode"
    :mode ("\\.djinni\\'" . djinni-mode))
#+END_SRC

*** Elixir

Simple mode for working with Elixir files.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package elixir-mode
    :ensure t
    :defer t)
#+END_SRC

*** Emacs Lisp

Suggest.el is a nice package that helps you discover Elisp functions
that do what you want.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package suggest
    :ensure t
    :defer t)
#+END_SRC

Debug macros is easier with macrostep:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package macrostep
    :ensure t
    :commands macrostep-mode)
#+END_SRC

*** Haskell

For Haskell I use haskell-mode.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package haskell-mode
    :ensure t
    :defer t)
#+END_SRC

*** JavaScript

For JavaScript and other related web technologies, use web-mode:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package web-mode
    :ensure t
    :mode
    (("\\.js\\'" . web-mode)
     ("\\.html?\\'" . web-mode)
     ("\\.phtml?\\'" . web-mode)
     ("\\.tpl\\.php\\'" . web-mode)
     ("\\.[agj]sp\\'" . web-mode)
     ("\\.as[cp]x\\'" . web-mode)
     ("\\.erb\\'" . web-mode)
     ("\\.mustache\\'" . web-mode)
     ("\\.djhtml\\'" . web-mode)
     ("\\.jsx$" . web-mode))
    :commands web-mode
    ;; Enable LSP support.
    :hook ((web-mode) . (lambda ()
                          ;; Set a local path to the Flow LSP binary.
                          (require 'lsp-clients)
                          (setq lsp-clients-flow-server (concat (projectile-project-root) "node_modules/.bin/flow"))
                          (lsp)))
    ;; Format code with Prettier.
    :bind (:map web-mode-map
                ("C-c u" . prettier)))
#+END_SRC

Also a minor mode for Flow:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package flow-minor-mode
    :ensure t
    :hook ('web-mode . flow-minor-enable-automatically))
#+END_SRC

*** Kotlin

Use kotlin-mode for Kotlin development.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package kotlin-mode
    :ensure t
    :defer t)
#+END_SRC

*** LaTeX

Use Auctex with tex-site for an excellent LaTeX environment. Also,
enable RefTeX mode whenever a LaTeX document is open.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
    (use-package tex-site
      :ensure auctex
      :hook ('LaTeX-mode . turn-on-reftex))
#+END_SRC

*** Markdown

I use markdown-mode to work on Markdown (.md) documents.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package markdown-mode
    :ensure t
    :mode (("\\`README\\.md\\'" . gfm-mode))
    :init (setq markdown-command "multimarkdown"))
#+END_SRC

I want to fontify code blocks in Markdown:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (setq markdown-fontify-code-blocks-natively t)
#+END_SRC

*** PHP

Emacs does not come with a mode for editing PHP mode. Just use
php-mode from the package repository.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package php-mode
    :ensure t
    :defer t)
#+END_SRC

*** Python

There are several packages for writing Python code. I use python.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package python
    :ensure t
    :interpreter ("python" . python-mode))
#+END_SRC

Format Python code according to PEP8:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package py-autopep8
    :ensure t
    :after python
    :bind
    (:map python-mode-map
          ("C-c u" . py-autopep8-buffer))
    :config
    (setq py-autopep8-options '("--max-line-length=79")))
#+END_SRC

*** Rust

Use rust-mode for editing Rust code:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package rust-mode
    :ensure t
    :defer t)
#+END_SRC

For code completion and navigation use Racer (TODO: Move to lsp-mode):

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package racer
    :ensure t
    :after rust-mode
    :hook ((rust-mode . racer-mode)
           (racer-mode . eldoc-mode)
           (racer-mode . company-mode))
    :config
    (define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
    (setq company-tooltip-align-annotations t))
#+END_SRC

*** Shell

TODO: For linting Shell scripts, I integrate Shellcheck with Flycheck.

*** Swift

I use swift-mode for Swift code.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package swift-mode
    :ensure t
    :mode ("\\.swift\\'")
    :hook (swift-mode . (lambda () (lsp))))
#+END_SRC

I have created Swift documentation in the Info format, so add a custom
path here:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (add-to-list 'Info-directory-list "~/Projects/swift-info/")
#+END_SRC

Add support for info-lookup:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'info-look)
  (info-lookup-maybe-add-help
   :mode 'swift-mode
   :regexp "[#@_a-zA-Z][_a-zA-Z0-9]*"
   :doc-spec '(("(swift)Index" nil "['`‘]" "['’]")))
#+END_SRC

*** TableGen

TableGen is an abstract IDL used by LLVM and related projects to
generate code automatically.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package tablegen-mode
    :load-path "~/Projects/llvm-project/llvm/utils/emacs"
    :mode ("\\.td\\'"))
#+END_SRC

** General Productivity Packages

This is the list of the packages I use for productivity when
programming, writing in a natural language, or managing Git, for
example.

