.emacs.d/init.el

;; Trailing Whitespace

;; Remove trailing whitespace before saving a file.


(add-hook 'before-save-hook 'delete-trailing-whitespace)

;; Window Management

;; I use winner-mode to manage my windows with convenient undo/redo functions.


(winner-mode 1)

;; Cross References

;; Use ivy-xref to select cross references:


(use-package ivy-xref
  :ensure t
  :after ivy
  :init (setq xref-show-xrefs-function #'ivy-xref-show-xrefs))

;; Programming Language Customizations

;; These are my customizations for the programming languages I use most.

;; I generally dislike tabs in my programs.


(setq-default indent-tabs-mode nil)

;; C/C++/Objective-C/Objective-C++

;; For C languages, I use K&R style, with an indentation of 2 spaces.


(use-package cc-mode
  :config
  (add-hook 'c-mode-common-hook (lambda ()
                           (c-set-style "k&r")
                           (setq c-basic-offset 2)))
  ;; Enable LSP support.
  :hook ((c-mode c++-mode objc-mode) .
         (lambda () (require 'ccls) (lsp)))
  ;; Format with clang-format.
  :bind (:map c-mode-base-map
              ("C-c u" . clang-format)))



;; As there's not a specific Emacs mode for this programming language,
;; for Objective-C++ files, use Objective-C mode.


(add-to-list 'auto-mode-alist '("\\.mm$" . objc-mode))



;; Use LSP with company, and ccls as C++ client.


(use-package lsp-mode
  :load-path "~/Projects/lsp-mode"
  :bind (:map lsp-mode-map
              ("C-c C-d" . lsp-describe-thing-at-point))
  :commands lsp
  :config
  (setq lsp-prefer-flymake nil)
  (setq xref-prompt-for-identifier '(not xref-find-definitions
                                         xref-find-definitions-other-window
                                         xref-find-definitions-other-frame
                                         xref-find-references)))

(use-package lsp-sourcekit
  :after lsp-mode
  :load-path "~/Projects/lsp-sourcekit"
  :config
  (setenv "SOURCEKIT_TOOLCHAIN_PATH" "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain")
  (setq lsp-sourcekit-executable (expand-file-name "~/Projects/sourcekit-lsp/.build/release/sourcekit-lsp")))



;; LSP UI contains higher level UI modules for lsp-mode, like flycheck
;; support or code lenses.


(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-sideline-enable nil))

(use-package company-lsp
  :ensure t
  :commands company-lsp)

(use-package ccls
  :ensure t
  :diminish ccls-code-lens-mode
  :after lsp-mode
  :config
  (add-hook 'lsp-after-open-hook #'ccls-code-lens-mode)
  (setq ccls-executable (expand-file-name "~/Projects/ccls/Release/ccls")))

;; Clojure

;; Cider is the "de facto" package for working on Clojure projects.


(use-package cider
  :ensure t
  :defer t)

;; Djinni

;; Djinni is a IDL by Dropbox that helps generating interface code in C++/Objective-C++/Java.


(use-package djinni-mode
  :load-path "~/Projects/djinni-mode")

;; Elixir

;; Simple mode for working with Elixir files.


(use-package elixir-mode
  :ensure t
  :defer t)

;; Emacs Lisp

;; Suggest.el is a nice package that helps you discover Elisp functions
;; that do what you want.


(use-package suggest
  :ensure t
  :defer t)



;; Debug macros is easier with macrostep:


(use-package macrostep
  :ensure t
  :commands macrostep-mode)

;; Haskell

;; For Haskell I use haskell-mode.


(use-package haskell-mode
  :ensure t
  :defer t)

;; JavaScript

;; For JavaScript and other related web technologies, use web-mode:


(use-package web-mode
  :ensure t
  :mode
  (("\\.js\\'" . web-mode)
   ("\\.html?\\'" . web-mode)
   ("\\.phtml?\\'" . web-mode)
   ("\\.tpl\\.php\\'" . web-mode)
   ("\\.[agj]sp\\'" . web-mode)
   ("\\.as[cp]x\\'" . web-mode)
   ("\\.erb\\'" . web-mode)
   ("\\.mustache\\'" . web-mode)
   ("\\.djhtml\\'" . web-mode)
   ("\\.jsx$" . web-mode))
  :commands web-mode
  ;; Enable LSP support.
  :hook ((web-mode) . (lambda ()
                        ;; Set a local path to the Flow LSP binary.
                        (require 'lsp-clients)
                        (setq lsp-clients-flow-server (concat (projectile-project-root) "node_modules/.bin/flow"))
                        (lsp)))
  ;; Format code with Prettier.
  :bind (:map web-mode-map
              ("C-c u" . prettier)))



;; Also a minor mode for Flow:


(use-package flow-minor-mode
  :ensure t
  :hook ('web-mode . flow-minor-enable-automatically))

;; Kotlin

;; Use kotlin-mode for Kotlin development.


(use-package kotlin-mode
  :ensure t
  :defer t)

;; LaTeX

;; Use Auctex with tex-site for an excellent LaTeX environment. Also,
;; enable RefTeX mode whenever a LaTeX document is open.


(use-package tex-site
  :ensure auctex
  :hook ('LaTeX-mode . turn-on-reftex))

;; Markdown

;; I use markdown-mode to work on Markdown (.md) documents.


(use-package markdown-mode
  :ensure t
  :mode (("\\`README\\.md\\'" . gfm-mode))
  :init (setq markdown-command "multimarkdown"))



;; I want to fontify code blocks in Markdown:


(setq markdown-fontify-code-blocks-natively t)

;; PHP

;; Emacs does not come with a mode for editing PHP mode. Just use
;; php-mode from the package repository.


(use-package php-mode
  :ensure t)

;; Python

;; There are several packages for writing Python code. I use python.


(use-package python
  :ensure t
  :interpreter ("python" . python-mode))



;; Format Python code according to PEP8:


(use-package py-autopep8
  :ensure t
  :after python
  :bind
  (:map python-mode-map
        ("C-c u" . py-autopep8-buffer))
  :config
  (setq py-autopep8-options '("--max-line-length=79")))

;; Rust

;; Use rust-mode for editing Rust code:


(use-package rust-mode
  :ensure t
  :defer t)



;; For code completion and navigation use Racer (TODO: Move to lsp-mode):


(use-package racer
  :ensure t
  :after rust-mode
  :hook ((rust-mode . racer-mode)
         (racer-mode . eldoc-mode)
         (racer-mode . company-mode))
  :config
  (define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
  (setq company-tooltip-align-annotations t))

;; Swift

;; I use swift-mode for Swift code.


(use-package swift-mode
  :ensure t
  :hook (swift-mode . (lambda () (lsp))))

;; TableGen

;; TableGen is an abstract IDL used by LLVM and related projects to
;; generate code automatically.


(use-package tablegen-mode
  :load-path "~/Projects/llvm-project/llvm/utils/emacs"
  :defer t)
