.emacs.d/init.org
*** Autocompletion

Autocompletion is very important for programming languages and natural
languages. I use company for that.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package company
    :ensure t
    :diminish
    :hook (after-init . global-company-mode)
    :config
    (setq company-backends (delete 'company-semantic company-backends)))
#+END_SRC

*** Bazel

Bazel is a build system created by Google:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package bazel-mode
    :ensure t
    :defer t)
#+END_SRC

*** Certificate Handling

I use a major mode for viewing certificates, CRLs, keys, ASN.1, etc.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package x509-mode
    :ensure t
    :defer
    :config
    (setq x509-openssl-cmd "/usr/local/opt/openssl/bin/openssl"))
#+END_SRC

*** CMake

CMake is a meta-build system that is commonly used in C++ projects.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package cmake-mode
    :ensure t
    :mode ("CMakeLists.txt" "\\.cmake\\'"))
#+END_SRC

Enable type-aware highlighting support for CMake files:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package cmake-font-lock
    :ensure t
    :hook (cmake-mode . cmake-font-lock-activate))
#+END_SRC

*** Code Formatting

Code formatting tools make smarter decisions than typical Emacs
indenters, specially for complex languages like C++. As yet, I use
clang-format for C++ and related languages.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package reformatter
    :ensure t
    :after projectile
    :config
    ;; Clang-format (C/C++/Objective-C)
    (defconst clang-format-command "clang-format")
    (reformatter-define clang-format
      :program clang-format-command
      :lighter "Clang-format")

    ;; Prettier (JavaScript)
    (reformatter-define prettier
      :program (concat (projectile-project-root) "node_modules/.bin/prettier")
      :args (list "--stdin" "--stdin-filepath" buffer-file-name)
      :lighter "Prettier"))
#+END_SRC

*** Code Navigation

Sourcetrail is a great indexer to make sense of a big C/C++/Java
project.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package sourcetrail
    :ensure t
    :bind ("C-c s" . sourcetrail-send-location))
#+END_SRC

For quick navigation inside a source file, I use ace-jump-mode.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ace-jump-mode
    :ensure t
    :bind ("C-c SPC" . ace-jump-mode))
#+END_SRC

Typically, I want to navigate quickly over the instances of a
particular symbol in a source file.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package highlight-symbol
    :ensure t
    :bind (:map prog-mode-map
                ("M-n" . highlight-symbol-next)
                ("M-p" . highlight-symbol-prev)))
#+END_SRC

*** Code Selection

Use expand-region to increase the selected region by semantic units.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package expand-region
    :ensure t
    :bind ("C-=" . er/expand-region))
#+END_SRC

*** Compiler Explorer

Rmsbolt is an offline alternative for Compiler Explorer:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package rmsbolt
    :ensure t
    :defer t
    :load-path "~/Projects/rmsbolt")
#+END_SRC

*** Copy as Format

I use a package to copy text from buffers in various formats:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package copy-as-format
    :ensure t
    :bind (("C-c w m" . copy-as-format-markdown)
           ("C-c w g" . copy-as-format-slack)
           ("C-c w o" . copy-as-format-org-mode)
           ("C-c w r" . copy-as-format-rst)
           ("C-c w s" . copy-as-format-github)
           ("C-c w w" . copy-as-format))
    :init
    (setq copy-as-format-default "github"))
#+END_SRC

*** Cucumber

Enable syntax highlighting and indentation for Cucumber test files:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package feature-mode
    :ensure t
    :mode (".feature$" . feature-mode))
#+END_SRC

*** Debugging

Debugging is very important when working on a program. I use RealGud,
which is a nice abstraction over several debuggers for programming
languages.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package realgud
    :ensure t
    :disabled t)
#+END_SRC

I'm also exploring DAP (Debug Adapter Protocol). A protocol created by
Microsoft, similar to LSP, to interact with debuggers:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package dap-mode
    :ensure t
    :load-path "~/Projects/dap-mode"
    :commands dap-mode
    :config
    (dap-mode 1)
    (require 'dap-ui)
    (dap-ui-mode 1)
    (require 'dap-lldb))
#+END_SRC

*** Directory Diffing

Use ztree for diffing two directories:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ztree
    :ensure t
    :defer t)
#+END_SRC

*** Documentation

For showing inline documentation for Emacs Lisp functions, I use eldoc.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package eldoc
    :ensure t
    :defer t
    :diminish eldoc-mode
    :config
    (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
    (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
    (add-hook 'ielm-mode-hook 'turn-on-eldoc-mode))
#+END_SRC

In general, I use Dash docsets for any programming language. For now,
dash-at-point only works for C++ files.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package dash-at-point
    :ensure t
    :config
    (add-to-list 'dash-at-point-mode-alist '(c++-mode . "cpp"))
    :bind
    ("C-c h" . dash-at-point))
#+END_SRC

*** Edit Indirect

The edit-indirect package lets me edit source code in a separate buffer.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package edit-indirect
    :ensure t
    :defer t)
#+END_SRC

*** Git

For working on Git repositories and associated services (currently
GitHub only) I use several packages.

**** Magit

Magit is the best Git porcelain I've ever used.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package magit
    :ensure t
    :bind
    ("C-x g" . magit-status)
    :config
    (magit-add-section-hook 'magit-status-sections-hook
                            'magit-insert-modules-overview
                            'magit-insert-unpulled-from-upstream)
    (setq magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1))
#+END_SRC

**** Git Gutter

Git Gutter shows git changes in a buffer visually.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package git-gutter
    :ensure t
    :custom
    (git-gutter:modified-sign "~")		; 
    (git-gutter:added-sign    "+")		; 
    (git-gutter:deleted-sign  "-")		; 
    :custom-face
    (git-gutter:modified ((t (:foreground "#f1fa8c" :background "#f1fa8c"))))
    (git-gutter:added    ((t (:foreground "#50fa7b" :background "#50fa7b"))))
    (git-gutter:deleted  ((t (:foreground "#ff79c6" :background "#ff79c6"))))
    :config
    (global-git-gutter-mode +1))
#+END_SRC

**** Git TimeMachine

git-timemachine is a package that intuitively shows previous versions
of a particular file from a Git repository.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package git-timemachine
    :ensure t
    :defer t)
#+END_SRC

**** Git Undo

Git-undo lets you select a region and revert changes in that region to
the most recent Git historical version.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package git-undo
    :load-path "~/.emacs.d/user-lisp/git-undo"
    :commands git-undo)
#+END_SRC

**** Browse at Remote

This package browses target pages at GitHub/Bitbucket.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package browse-at-remote
    :ensure t
    :bind
    ("C-c g g" . browse-at-remote))
#+END_SRC

**** Forge

Forge is a package similar to Magithub:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package forge
    :ensure t
    :after magit)
#+END_SRC

*** Google Test

For running Google Tests from a given buffer, I have created a simple
minor mode (must be enabled manually):

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'gtest-mode)
#+END_SRC

*** Helpful

Better help system.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package helpful
    :ensure t
    :bind
    (
     ("C-h f" . helpful-callable)
     ("C-h v" . helpful-variable)
     ("C-h k" . helpful-key)
     ("C-c C-d" . helpful-at-point)
     ("C-h C" . helpful-command)))
#+END_SRC

*** Htmlize

Htmlize converts buffer text and decorations to HTML:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package htmlize
    :ensure t
    :commands htmlize-buffer)
#+END_SRC

*** Image Editing

Blimp is a great wrapper for ImageMagick:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package blimp
    :ensure t
    :hook (image-minor-mode . blimp-mode))
#+END_SRC

