.emacs.d/init.el

;; Autocompletion

;; Autocompletion is very important for programming languages and natural
;; languages. I use company for that.


(use-package company
  :ensure t
  :diminish
  :hook (after-init . global-company-mode)
  :config
  (setq company-backends (delete 'company-semantic company-backends)))

;; Bazel

;; Bazel is a build system created by Google:


(use-package bazel-mode
  :ensure t
  :defer t)

;; CMake

;; CMake is a meta-build system that is commonly used in C++ projects.


(use-package cmake-mode
  :ensure t
  :mode ("CMakeLists.txt" "\\.cmake\\'"))



;; Enable type-aware highlighting support for CMake files:


(use-package cmake-font-lock
  :ensure t
  :hook (cmake-mode . cmake-font-lock-activate))

;; Code Formatting

;; Code formatting tools make smarter decisions than typical Emacs
;; indenters, specially for complex languages like C++. As yet, I use
;; clang-format for C++ and related languages.


(use-package reformatter
  :ensure t
  :after projectile
  :config
  ;; Clang-format (C/C++/Objective-C)
  (defconst clang-format-command "clang-format")
  (reformatter-define clang-format
    :program clang-format-command
    :lighter "Clang-format")

  ;; Prettier (JavaScript)
  (reformatter-define prettier
    :program (concat (projectile-project-root) "node_modules/.bin/prettier")
    :args (list "--stdin" "--stdin-filepath" buffer-file-name)
    :lighter "Prettier"))

;; Code Navigation

;; Sourcetrail is a great indexer to make sense of a big C/C++/Java
;; project.


(use-package sourcetrail
  :ensure t
  :bind ("C-c s" . sourcetrail-send-location))



;; For quick navigation inside a source file, I use ace-jump-mode.


(use-package ace-jump-mode
  :ensure t
  :bind ("C-c SPC" . ace-jump-mode))



;; Typically, I want to navigate quickly over the instances of a
;; particular symbol in a source file.


(use-package highlight-symbol
  :ensure t
  :bind (:map prog-mode-map
              ("M-n" . highlight-symbol-next)
              ("M-p" . highlight-symbol-prev)))

;; Code Selection

;; Use expand-region to increase the selected region by semantic units.


(use-package expand-region
  :ensure t
  :bind ("C-=" . er/expand-region))

;; Compiler Explorer

;; Rmsbolt is an offline alternative for Compiler Explorer:


(use-package rmsbolt
  :load-path "~/Projects/rmsbolt")

;; Copy as Format

;; I use a package to copy text from buffers in various formats:


(use-package copy-as-format
  :ensure t
  :bind (("C-c w m" . copy-as-format-markdown)
         ("C-c w g" . copy-as-format-slack)
         ("C-c w o" . copy-as-format-org-mode)
         ("C-c w r" . copy-as-format-rst)
         ("C-c w s" . copy-as-format-github)
         ("C-c w w" . copy-as-format))
  :init
  (setq copy-as-format-default "github"))

;; Cucumber

;; Enable syntax highlighting and indentation for Cucumber test files:


(use-package feature-mode
  :ensure t
  :mode (".feature$" . feature-mode))

;; Debugging

;; Debugging is very important when working on a program. I use RealGud,
;; which is a nice abstraction over several debuggers for programming
;; languages.


(use-package realgud
  :ensure t
  :disabled t)



;; I'm also exploring DAP (Debug Adapter Protocol). A protocol created by
;; Microsoft, similar to LSP, to interact with debuggers:


(use-package dap-mode
  :after lsp-mode
  :load-path "~/Projects/dap-mode"
  :config
  (dap-mode 1)
  (dap-ui-mode 1)
  (require 'dap-lldb))

;; Diminish

;; Use diminish.el to reduce the number of lighters to show in the mode line:


(use-package diminish
  :ensure t
  :demand t)

;; Directory Diffing

;; Use ztree for diffing two directories:


(use-package ztree
  :ensure t
  :defer t)

;; Documentation

;; For showing inline documentation for Emacs Lisp functions, I use eldoc.


(use-package eldoc
  :ensure t
  :defer t
  :diminish eldoc-mode
  :config
  (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
  (add-hook 'ielm-mode-hook 'turn-on-eldoc-mode))



;; In general, I use Dash docsets for any programming language. For now,
;; dash-at-point only works for C++ files.


(use-package dash-at-point
  :ensure t
  :config
  (add-to-list 'dash-at-point-mode-alist '(c++-mode . "cpp"))
  :bind
  ("C-c h" . dash-at-point))

;; Edit Indirect

;; The edit-indirect package lets me edit source code in a separate buffer.


(use-package edit-indirect
  :ensure t
  :defer t)

;; Magit

;; Magit is the best Git porcelain I've ever used.


(use-package magit
  :ensure t
  :bind
  ("C-x g" . magit-status)
  :config
  (magit-add-section-hook 'magit-status-sections-hook
                          'magit-insert-modules-overview
                          'magit-insert-unpulled-from-upstream)
  (setq magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1))



;; * Git Gutter


(use-package git-gutter
  :ensure t
  :custom
  (git-gutter:modified-sign "~")		; 
  (git-gutter:added-sign    "+")		; 
  (git-gutter:deleted-sign  "-")		; 
  :custom-face
  (git-gutter:modified ((t (:foreground "#f1fa8c" :background "#f1fa8c"))))
  (git-gutter:added    ((t (:foreground "#50fa7b" :background "#50fa7b"))))
  (git-gutter:deleted  ((t (:foreground "#ff79c6" :background "#ff79c6"))))
  :config
  (global-git-gutter-mode +1))

;; Git TimeMachine

;; git-timemachine is a package that intuitively shows previous versions
;; of a particular file from a Git repository.


(use-package git-timemachine
  :ensure t
  :defer t)

;; Git Undo

;; Git-undo lets you select a region and revert changes in that region to
;; the most recent Git historical version.


(add-to-list 'load-path "~/.emacs.d/user-lisp/git-undo")

;; Browse at Remote

;; This package browses target pages at GitHub/Bitbucket.


(use-package browse-at-remote
  :ensure t
  :bind
  ("C-c g g" . browse-at-remote))

;; Forge

;; Forge is a package similar to Magithub:


(use-package forge
  :ensure t
  :after magit)

;; Google Test

;; For running Google Tests from a given buffer, I have created a simple
;; minor mode (must be enabled manually):


(require 'gtest-mode)

;; Helpful

;; Better help system.


(use-package helpful
  :ensure t
  :bind
  (
   ("C-h f" . helpful-callable)
   ("C-h v" . helpful-variable)
   ("C-h k" . helpful-key)
   ("C-c C-d" . helpful-at-point)
   ("C-h C" . helpful-command)))

;; Htmlize

;; Htmlize converts buffer text and decorations to HTML:


(use-package htmlize
  :ensure t
  :commands htmlize-buffer)

;; Image Editing

;; Blimp is a great wrapper for ImageMagick:


(use-package blimp
  :ensure t
  :hook (image-minor-mode . blimp-mode))

;; Ivy
