.emacs.d/init.org
*** Ivy

Ivy is a lightweight completion framework.

Install counsel first:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package counsel
    :ensure t
    :defer t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package counsel-projectile
    :ensure t
    :after counsel
    :init
    (counsel-projectile-mode)
    :config
    (setq counsel-find-file-ignore-regexp
        (concat
         ;; File names beginning with # or .
         "\\(?:\\`[#.]\\)"
         ;; File names ending with # or ~
         "\\|\\(?:\\`.+?[#~]\\'\\)")))
#+END_SRC

Smex is an enhancement for M-x.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package smex
     :ensure t
     :after counsel)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ivy
    :ensure t
    :diminish
    :config
    (ivy-mode 1)

    ;; When switching buffers, offer recently accessed files that we don't
    ;; currently have open.
    (setq ivy-use-virtual-buffers t)

    (setq ivy-count-format "(%d/%d) ")

    ;; Don't require order, so 'func descr' matches 'describe-function'
    (setq ivy-re-builders-alist
          '((t . ivy--regex-ignore-order)))

    ;; Don't show ./ and ../ when finding files with ivy.
    ;; To go up a directory, use backspace.
    (setq ivy-extra-directories nil)

    ;; Highlight the current selection with an arrow too.
    (setq ivy-format-function 'ivy-format-function-arrow)

    ;; Don't start the search term with ^ by default. I often have a
    ;; substring in mind.
    (setq ivy-initial-inputs-alist nil)

    ;; Allow using the input as entered. This is useful when you want to
    ;; input a value that doesn't yet exist, such as creating a new file
    ;; with C-x C-f.
    (setq ivy-use-selectable-prompt t)
    :bind
    (
     ("M-x" . counsel-M-x)
     ("C-x C-f" . counsel-find-file)
     ("<f1> f" . counsel-describe-function)
     ("<f1> v" . counsel-describe-variable)
     ("C-s" . swiper)
     ("<f7>" . counsel-imenu)
     ("M-y" . counsel-yank-pop)
     ("C-x b"   . ivy-switch-buffer)
     :map ivy-minibuffer-map
     ("M-y" . ivy-next-line)))

  ;; Use ido for projectile features, primarily C-x C-g (finding
  ;; files) and C-c p p (switching projects).
  (require 'projectile)
  (setq projectile-completion-system 'ivy)
#+END_SRC

Extend ivy with ivy-rich:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
(use-package ivy-rich
  :ensure t
  :after ivy
  :config
  (ivy-rich-mode 1)
  (setq ivy-virtual-abbreviate 'full
        ivy-rich-switch-buffer-align-virtual-buffer t
        ivy-rich-path-style 'abbrev))
#+END_SRC

*** iOS Simulators

For accessing iOS simulator folders, I've created a simple minor mode:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'ios-simulator)
#+END_SRC

*** Natural Languages

For checking spelling and grammar, I use an external Java tool: Language-tool.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
    (use-package langtool
      :ensure t
      :commands langtool-check-buffer
      :config
      (setq langtool-language-tool-jar "/usr/local/Cellar/languagetool/4.3/libexec/languagetool-commandline.jar"))
#+END_SRC

*** Org-Mode

Org-Mode configuration is handled in a separate file.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (require 'org-mode-config)
#+END_SRC

*** PDF Tools

I want a nice way to work on PDF documents graphically.

Install with `brew install pdf-tools`.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package pdf-tools
    :ensure t
    :defer t
    :config
    (custom-set-variables
     '(pdf-tools-handle-upgrades nil))
    (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo")
    (pdf-tools-install))
#+END_SRC

pdf-linter will "lint" a PDF document using PDFBox Preflight app.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package pdf-linter
    :load-path "~/.emacs.d/user-lisp/pdf-linter"
    :defer t
    :config
    (setq pdf-linter-jar "$HOME/PDFBox/preflight-app-2.0.12.jar"))
#+END_SRC

Interleave is a minor mode to interleave notes in PDF books/papers.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package interleave
    :ensure t
    :after pdf-tools)
#+END_SRC

*** Project Management

Programs are usually organized in projects, being a Git repo a natural
way to define one. I use Projectile to work on projects.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package projectile
    :ensure t
    :config
    (projectile-global-mode)
    :bind-keymap ("C-c p" . projectile-command-map))
#+END_SRC

*** Pandoc

Pandoc is a tool to convert between almost every document format.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package pandoc-mode
    :ensure t
    :defer t)
#+END_SRC

*** Pass

I use Pass as password manager. Integrate it with Ivy:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package ivy-pass
    :ensure t
    :commands ivy-pass)
#+END_SRC

*** REST

For making REST calls from Emacs, I use the convenient restclient package.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package restclient
    :ensure t
    :defer t)
#+END_SRC

*** Search

For searching things, I use deadgrep, a nice interface over
ripgrep. Very fast.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package deadgrep
    :ensure t
    :bind ("<f5>" . deadgrep))
#+END_SRC

*** Shell

Easy management of shell buffers.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package shell-toggle
    :ensure t)
#+END_SRC

*** Snippets and Abbreviations

I use yasnippet for managing text snippets.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode
    :init (yas-global-mode 1))
#+END_SRC

*** Syntax checking

I use flycheck for "on the fly" syntax checking.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package flycheck
    :ensure t
    :defer t)
#+END_SRC

For linting packages intended to be published on MELPA, use flycheck-package:

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package flycheck-package
    :ensure t
    :after flycheck)
#+END_SRC

*** Undo

For a more intuitive undo/redo management, I use undo-tree instead of
the default undo/redo system.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package undo-tree
    :ensure t
    :defer t
    :diminish undo-tree-mode
    :init (global-undo-tree-mode)
    :config
    (setq undo-tree-visualizer-timestamps t)
    (setq undo-tree-visualizer-diff t))
#+END_SRC

*** Xcode Projects

I've created a package for working on Xcode projects.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package pbxproj-mode
    :load-path "~/.emacs.d/user-lisp/pbxproj-mode"
    :defer t)
#+END_SRC

I've also added on-the-fly syntax checking capabilities.

#+BEGIN_SRC emacs-lisp :tangle yes :comments org
  (use-package flycheck-pbxproj
    :load-path "~/.emacs.d/user-lisp/flycheck-pbxproj"
    :defer t)
#+END_SRC
