.emacs.d/init.el

;; Ivy is a lightweight completion framework.

;; Install counsel first:


(use-package counsel
  :ensure t
  :defer t)

(use-package counsel-projectile
  :ensure t
  :after counsel
  :init
  (counsel-projectile-mode)
  :config
  (setq counsel-find-file-ignore-regexp
      (concat
       ;; File names beginning with # or .
       "\\(?:\\`[#.]\\)"
       ;; File names ending with # or ~
       "\\|\\(?:\\`.+?[#~]\\'\\)")))



;; Smex is an enhancement for M-x.


(use-package smex
   :ensure t
   :after counsel)

(use-package ivy
  :ensure t
  :diminish
  :config
  (ivy-mode 1)

  ;; When switching buffers, offer recently accessed files that we don't
  ;; currently have open.
  (setq ivy-use-virtual-buffers t)

  (setq ivy-count-format "(%d/%d) ")

  ;; Don't require order, so 'func descr' matches 'describe-function'
  (setq ivy-re-builders-alist
        '((t . ivy--regex-ignore-order)))

  ;; Don't show ./ and ../ when finding files with ivy.
  ;; To go up a directory, use backspace.
  (setq ivy-extra-directories nil)

  ;; Highlight the current selection with an arrow too.
  (setq ivy-format-function 'ivy-format-function-arrow)

  ;; Don't start the search term with ^ by default. I often have a
  ;; substring in mind.
  (setq ivy-initial-inputs-alist nil)

  ;; Allow using the input as entered. This is useful when you want to
  ;; input a value that doesn't yet exist, such as creating a new file
  ;; with C-x C-f.
  (setq ivy-use-selectable-prompt t)
  :bind
  (
   ("M-x" . counsel-M-x)
   ("C-x C-f" . counsel-find-file)
   ("<f1> f" . counsel-describe-function)
   ("<f1> v" . counsel-describe-variable)
   ("C-s" . swiper)
   ("<f7>" . counsel-imenu)
   ("M-y" . counsel-yank-pop)
   ("C-x b"   . ivy-switch-buffer)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line)))

;; Use ido for projectile features, primarily C-x C-g (finding
;; files) and C-c p p (switching projects).
(require 'projectile)
(setq projectile-completion-system 'ivy)



;; Extend ivy with ivy-rich:


(use-package ivy-rich
  :ensure t
  :after ivy
  :config
  (ivy-rich-mode 1)
  (setq ivy-virtual-abbreviate 'full
        ivy-rich-switch-buffer-align-virtual-buffer t
        ivy-rich-path-style 'abbrev))

;; iOS Simulators

;; For accessing iOS simulator folders, I've created a simple minor mode:


(require 'ios-simulator)

;; Natural Languages

;; For checking spelling and grammar, I use an external Java tool: Language-tool.


(use-package langtool
  :ensure t
  :commands langtool-check-buffer
  :config
  (setq langtool-language-tool-jar "/usr/local/Cellar/languagetool/4.3/libexec/languagetool-commandline.jar"))

;; Org-Mode

;; Org-Mode configuration is handled in a separate file.


(require 'org-mode-config)

;; PDF Tools

;; I want a nice way to work on PDF documents graphically.

;; Install with `brew install pdf-tools`.


(use-package pdf-tools
  :ensure t
  :defer t
  :config
  (custom-set-variables
   '(pdf-tools-handle-upgrades nil))
  (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo")
  (pdf-tools-install))



;; pdf-linter will "lint" a PDF document using PDFBox Preflight app.


(use-package pdf-linter
  :load-path "~/.emacs.d/user-lisp/pdf-linter"
  :defer t
  :config
  (setq pdf-linter-jar "$HOME/PDFBox/preflight-app-2.0.12.jar"))



;; Interleave is a minor mode to interleave notes in PDF books/papers.


(use-package interleave
  :ensure t
  :after pdf-tools)

;; Project Management

;; Programs are usually organized in projects, being a Git repo a natural
;; way to define one. I use Projectile to work on projects.


(use-package projectile
  :ensure t
  :config
  (projectile-global-mode)
  :bind-keymap ("C-c p" . projectile-command-map))

;; Pandoc

;; Pandoc is a tool to convert between almost every document format.


(use-package pandoc-mode
  :ensure t
  :defer t)

;; Pass

;; I use Pass as password manager. Integrate it with Ivy:


(use-package ivy-pass
  :ensure t
  :commands ivy-pass)

;; REST

;; For making REST calls from Emacs, I use the convenient restclient package.


(use-package restclient
  :ensure t
  :defer t)

;; Search

;; For searching things, I use deadgrep, a nice interface over
;; ripgrep. Very fast.


(use-package deadgrep
  :ensure t
  :bind ("<f5>" . deadgrep))

;; Shell

;; Easy management of shell buffers.


(use-package shell-toggle
  :ensure t)

;; Snippets and Abbreviations

;; I use yasnippet for managing text snippets.


(use-package yasnippet
  :ensure t
  :diminish yas-minor-mode
  :init (yas-global-mode 1))

;; Syntax checking

;; I use flycheck for "on the fly" syntax checking.


(use-package flycheck
  :ensure t
  :defer t)



;; For linting packages intended to be published on MELPA, use flycheck-package:


(use-package flycheck-package
  :ensure t
  :after flycheck)

;; Undo

;; For a more intuitive undo/redo management, I use undo-tree instead of
;; the default undo/redo system.


(use-package undo-tree
  :ensure t
  :defer t
  :diminish undo-tree-mode
  :init (global-undo-tree-mode)
  :config
  (setq undo-tree-visualizer-timestamps t)
  (setq undo-tree-visualizer-diff t))

;; X.509

;; I've created a simple major mode that toggles between showing raw and
;; detailed information about a X.509 certificate.


(use-package x509-certificate-mode
  :defer t)

;; Xcode Projects

;; I've created a package for working on Xcode projects.


(use-package pbxproj-mode
  :load-path "~/.emacs.d/user-lisp/pbxproj-mode"
  :defer t)



;; I've also added on-the-fly syntax checking capabilities.


(use-package flycheck-pbxproj
  :load-path "~/.emacs.d/user-lisp/flycheck-pbxproj"
  :defer t)
